In [1]:
import pandas as pd;
import numpy as np

In [2]:
from pandas import Series, DataFrame

In [3]:
# two major data types in pandas are series and DataFrames

In [4]:
# Series are one dimensional similar to R vectors they also have an index labels

In [5]:
# example

In [6]:
x = Series([4,7,-5,3])

In [7]:
x

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
# extract the values and indexes seperately

In [9]:
x.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
x.values

array([ 4,  7, -5,  3])

In [11]:
# you can index them with labels

In [12]:
x2 = Series([1,2,3],index=['a','b','c'])

In [13]:
x2

a    1
b    2
c    3
dtype: int64

In [14]:
x2.index

Index(['a', 'b', 'c'], dtype='object')

In [15]:
# you can use boolean filtering like in R

In [17]:
x2[x2.index == 'a']

a    1
dtype: int64

In [18]:
x2[x2 > 2]

c    3
dtype: int64

In [23]:
np.exp(x2)

a     2.718282
b     7.389056
c    20.085537
dtype: float64

In [24]:
x2*2

a    2
b    4
c    6
dtype: int64

In [25]:
# Series are like dict

In [26]:
# you can use similar code for one or the other

In [27]:
'a' in x2

True

In [29]:
# you can easily convert a dict to a Series

In [30]:
# syntac - obj = Series(dict)

In [31]:
# however the keys will be in the sorted order

In [32]:
# you might want to do it manually

In [33]:
# example

In [12]:
sdata = {"Ohio":35000, "Texas":71000, "Oregon":16000, "Utah":5000}

In [13]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [14]:
x = Series(sdata);x

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [39]:
# you might also want to assign the indexes seperately

In [3]:
# Missing values are covered more in depth in chapter 7

In [4]:
# briefly you can use pd.isnull(x) or pd.notnull(x)

In [5]:
# if you add series it will concatenate them.

In [6]:
# however it won't duplicate things with the same index

In [7]:
# also if no index is available it will automatically be assigned to NA

In [8]:
# this is similar to a join feature

In [16]:
x.name = 'Name'

In [17]:
x

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: Name, dtype: int64

In [18]:
x.name

'Name'

In [19]:
x.index.name = 'index name'

In [20]:
x

index name
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: Name, dtype: int64

In [25]:
# indexes can be reassigned like arrays

In [26]:
x.index = ['A','B','C','D']

In [27]:
x

A    35000
B    71000
C    16000
D     5000
Name: Name, dtype: int64

In [28]:
len(x)

4

In [ ]:
# ---------------------------------DataFrames ----------------------------------------------

In [ ]:
# ------------------------------------------------------------------------------------------

In [29]:
# data frames are a collection of columns all sharing the same index

In [ ]:
# data frames can be constructed from arrays or dicts

In [30]:
# method 1

In [45]:
data = {
'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
'year': [2000,2001,2002,2001,2002,2003],
'pop': [1.5,1.7,3.6,2.4,2.9,3.2]

}

In [46]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [47]:
dat = pd.DataFrame(data)

In [48]:
dat

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [49]:
dat.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [50]:
dat.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [51]:
# head is just like in R

In [52]:
# you can specify a sequence of columns

In [53]:
dat = pd.DataFrame(data, columns = ['year','state','pop','debt'])

In [54]:
dat

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [55]:
# you can access specific columns as a series

In [56]:
dat['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [57]:
dat.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [58]:
# note that data.column only works when column is a valid python name

In [59]:
# you can also access access rows by number or index

In [60]:
dat.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [61]:
# is there a way to access columns by index???

In [62]:
# columns could be assigned with indexing

In [63]:
dat.debt = 16

In [64]:
dat

   year   state  pop  debt
0  2000    Ohio  1.5    16
1  2001    Ohio  1.7    16
2  2002    Ohio  3.6    16
3  2001  Nevada  2.4    16
4  2002  Nevada  2.9    16
5  2003  Nevada  3.2    16

In [65]:
# you can add a series to a data frame. It will match the indexes. If no match it will return NaN

In [66]:
val = Series( [-1.2,-1.5,-1.7],index=['two','four','five'])

In [67]:
dat.index =['one','two','three','four','five','six'];
dat['debt'] = val

In [68]:
dat

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [69]:
# new columns must be created with the ['string'] syntax not data.column syntax

In [70]:
dat['eastern'] = (dat.state == 'Ohio')

In [71]:
dat

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [72]:
# you can delete columns with del command

In [73]:
del dat['eastern']

In [74]:
dat.head(3)

       year state  pop  debt
one    2000  Ohio  1.5   NaN
two    2001  Ohio  1.7  -1.2
three  2002  Ohio  3.6   NaN

In [75]:
# again you must use the string syntax

In [76]:
dat.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [77]:
# use columns to extract the column names index to extract the index names

In [78]:
# note that the column returned from indexing is a veiw you can copy it alternatively

In [79]:
# another method is to use a dict of dicts. I skipped this because it looks annoying

In [80]:
dat

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [82]:
# data frames can be transposed just like arrays

In [83]:
dat.T

        one   two three    four    five     six
year   2000  2001  2002    2001    2002    2003
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9     3.2
debt    NaN  -1.2   NaN    -1.5    -1.7     NaN

In [84]:
dat

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [85]:
# the book discusses more about using dicts and series to contruct data frames

In [86]:
# accessing names

In [88]:
dat.name ='Name'

In [89]:
dat

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [92]:
dat.index.name = 'year'

In [93]:
dat.index.name

'year'

In [94]:
dat

       year   state  pop  debt
year
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [95]:
dat.columns.name = 'state'

In [96]:
dat

state  year   state  pop  debt
year
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [97]:
# I think it displays better without the names

In [98]:
dat.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [99]:
# The result is an array the dtype is chosen to accomodate all of the values

In [100]:
# the book has a long list of ways to create a data frame

In [101]:
# ---------------------------INDEX OBJECTS ------------------------------------

In [102]:
#------------------------------------------------------------------------------

In [103]:
# index objects are responsible for holding labels and other metadata like names

In [104]:
# an example with series

In [105]:
obj = pd.Series(range(3), index = ['a','b','c'])

In [106]:
index = obj.index

In [107]:
index

Index(['a', 'b', 'c'], dtype='object')

In [108]:
index[1:]

Index(['b', 'c'], dtype='object')

In [109]:
# indexes are immutable meaning you can't alter specific elements

In [110]:
index[1] = 'blah'

TypeError: Index does not support mutable operations

In [111]:
# in contrast in R labels are often distorted during the process so tidyverse decided not to use labels at all

In [112]:
# lets suppose you want to capture the labels

In [113]:
labels = pd.Index(np.arange(3))

In [114]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [115]:
# now you can assign those to a new series

In [116]:
obj2 = pd.Series([1.5,-2.5,0],index = labels)

In [117]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [118]:
# note that the Index function does not create a view so I think the labels stay in tact

In [119]:
# labels can have duplicates unlike sets.

In [120]:
dat

state  year   state  pop  debt
year
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [121]:
'state' in dat.columns

True

In [122]:
'Ohio' in dat.columns

False

In [123]:
'one' in dat.index

True

In [124]:
'state' in dat.index

False

In [125]:
# there are some useful index functions listed in the book

In [126]:
# append, difference, intersection, union etc. You should go over these at some point

In [127]:
# ---------------------------- ESSENTIAL FUNCTIONALITY ----------------------------------------

In [128]:
# --------------------------------------------------------------------------------------------

In [129]:
# reindexing

In [130]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index = ['d','b','a','c'])

In [131]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [134]:
print(obj,obj2)

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64 a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [135]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [136]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [137]:
# essentially we reordered it based on the new index

In [141]:
obj3 = pd.Series( ['blue', 'purple','yellow'], index = [0,2,4])

In [139]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [140]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [142]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [143]:
# ffill seems to fill in missing values somehow

In [144]:
# reindex can also be used on a data frame for either rows or column names

In [145]:
# the defualt is rows for columns you need to specify columns as in data.reindex(columns = new_values)

In [146]:
dat

state  year   state  pop  debt
year
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [147]:
dat.loc

In [149]:
# there is different method using loc but I didn't understand the book

In [ ]:
# there is a list of indexing functions in table 5-3

In [150]:
# dropping an element associated with an index

In [151]:
obj = pd.Series(np.arange(5.),index = ['a','b','c','d','e'])

In [153]:
new_obj = obj.drop('c')

In [154]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [155]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [156]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [158]:
# you can also do this with columns as well in a data frame

In [159]:
# example

In [161]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                    index = ['Ohio','Colorado','Utah','New York'],
                    columns = ['one','two','three','four']
                   )

In [163]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [164]:
data.drop('two',axis = 'columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [165]:
# by default data.drop assumes you mean the rows

In [166]:
# many functions that modify the size or shape of an object have an inplace argument 
# which modifies it without returning a new object

In [167]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [168]:
data.drop('two',axis = 'columns',inplace=True)

In [169]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [170]:
# without in place you could do data2 = data.drop(...)
# with in place you don't need to assign a new object

In [ ]:
# series indexing is similar to DataFrame indexing except you can do x[value] or x[index]

In [172]:
# if you ask for a single value it will give it to you without the index other wise it will return both

In [175]:
x = pd.Series( np.arange(4.), index = ['a','b','c','d'])

In [176]:
x['b']

1.0

In [177]:
x[['b','a']]

b    1.0
a    0.0
dtype: float64

In [178]:
x[[3,1]]

d    3.0
b    1.0
dtype: float64

In [179]:
# alternativelt as mentioned before you could use a logical sequence as well

In [180]:
# slicing with labels

In [182]:
x['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [183]:
# its all inclusive with string labels

In [184]:
# can also assign like x['a':'d'] = 5

In [185]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [186]:
# more on indexing with DataFrames

In [187]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int64

In [191]:
data[['four','one']]

          four  one
Ohio         3    0
Colorado     7    4
Utah        11    8
New York    15   12

In [192]:
s = ['one','four']

In [193]:
data[s]

          one  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

In [194]:
# what about rows

In [197]:
# base python row filtering can be kind of clunky

In [198]:
data[data['four'] > 5]

          one  three  four
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [199]:
# using : can select rows

In [200]:
data[:2]

          one  three  four
Ohio        0      2     3
Colorado    4      6     7

In [201]:
# logic on the entire data set
data < 5

            one  three   four
Ohio       True   True   True
Colorado   True  False  False
Utah      False  False  False
New York  False  False  False

In [203]:
# you can also index with loc and iloc
# loc is subsetting with string iloc is subsetting with numbers
# loc methods allow subsetting both rows and columns at once with less code

In [205]:
data.loc[ ['Colorado','Utah']   , ['one','four']    ]

          one  four
Colorado    4     7
Utah        8    11

In [206]:
# if it ends up being one dimensional than it no longer stays a data frame

In [214]:
data.iloc[ [1,2] ,[0,2] ]

          one  four
Colorado    4     7
Utah        8    11

In [218]:
data.iloc[1]

one      4
three    6
four     7
Name: Colorado, dtype: int64

In [216]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [219]:
# how about just columns with loc?

In [220]:
data.iloc[:,1]

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int64

In [221]:
# good to review a couple of the methods for selecting and filtering data on the table listed

In [ ]:
# --------------------------------------INTERNET SUPPLIMENT---------------------------------------------------

In [225]:
# find the shape
data.shape

SyntaxError: invalid syntax (<ipython-input-225-07c7bbe23a74>, line 2)

In [226]:
# suppose we use a built in iris data set

In [229]:
import seaborn.apionly as sns;
iris = sns.load_dataset('iris')

/anaconda3/lib/python3.6/site-packages/seaborn/apionly.py:6: UserWarning: As seaborn no longer sets a default style on import, the seaborn.apionly module is deprecated. It will be removed in a future version.
  warnings.warn(msg, UserWarning)

In [232]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [243]:
iris .query('sepal_length > 4.5 & petal_length < 1.5')

(19, 5)

In [235]:
type(iris)

pandas.core.frame.DataFrame

In [ ]:
# two indicated ways to select columns

In [245]:
iris[ ['sepal_length','petal_length']]

(150, 2)

In [247]:
iris.loc[:,['sepal_length','petal_length']].head()

   sepal_length  petal_length
0           5.1           1.4
1           4.9           1.4
2           4.7           1.3
3           4.6           1.5
4           5.0           1.4

In [250]:
iris.drop('sepal_length',axis = 1).head()

   sepal_width  petal_length  petal_width species
0          3.5           1.4          0.2  setosa
1          3.0           1.4          0.2  setosa
2          3.2           1.3          0.2  setosa
3          3.1           1.5          0.2  setosa
4          3.6           1.4          0.2  setosa

In [260]:
# sampling

In [261]:
iris.sample(n=10)

     sepal_length  sepal_width  petal_length  petal_width     species
139           6.9          3.1           5.4          2.1   virginica
22            4.6          3.6           1.0          0.2      setosa
12            4.8          3.0           1.4          0.1      setosa
45            4.8          3.0           1.4          0.3      setosa
70            5.9          3.2           4.8          1.8  versicolor
41            4.5          2.3           1.3          0.3      setosa
145           6.7          3.0           5.2          2.3   virginica
5             5.4          3.9           1.7          0.4      setosa
75            6.6          3.0           4.4          1.4  versicolor
60            5.0          2.0           3.5          1.0  versicolor

In [264]:
iris.sample(frac=.10)

     sepal_length  sepal_width  petal_length  petal_width     species
6             4.6          3.4           1.4          0.3      setosa
137           6.4          3.1           5.5          1.8   virginica
3             4.6          3.1           1.5          0.2      setosa
79            5.7          2.6           3.5          1.0  versicolor
145           6.7          3.0           5.2          2.3   virginica
64            5.6          2.9           3.6          1.3  versicolor
112           6.8          3.0           5.5          2.1   virginica
60            5.0          2.0           3.5          1.0  versicolor
132           6.4          2.8           5.6          2.2   virginica
45            4.8          3.0           1.4          0.3      setosa
85            6.0          3.4           4.5          1.6  versicolor
143           6.8          3.2           5.9          2.3   virginica
17            5.1          3.5           1.4          0.3      setosa
37            4.9          3.6           1.4          0.1      setosa
136           6.3          3.4           5.6          2.4   virginica

In [265]:
# sorting

In [266]:
iris.sort_values(['sepal_length','sepal_length'])

     sepal_length  sepal_width  petal_length  petal_width     species
13            4.3          3.0           1.1          0.1      setosa
8             4.4          2.9           1.4          0.2      setosa
38            4.4          3.0           1.3          0.2      setosa
42            4.4          3.2           1.3          0.2      setosa
41            4.5          2.3           1.3          0.3      setosa
3             4.6          3.1           1.5          0.2      setosa
6             4.6          3.4           1.4          0.3      setosa
22            4.6          3.6           1.0          0.2      setosa
47            4.6          3.2           1.4          0.2      setosa
2             4.7          3.2           1.3          0.2      setosa
29            4.7          3.2           1.6          0.2      setosa
11            4.8          3.4           1.6          0.2      setosa
12            4.8          3.0           1.4          0.1      setosa
24            4.8          3.4           1.9          0.2      setosa
30            4.8          3.1           1.6          0.2      setosa
45            4.8          3.0           1.4          0.3      setosa
1             4.9          3.0           1.4          0.2      setosa
9             4.9          3.1           1.5          0.1      setosa
34            4.9          3.1           1.5          0.2      setosa
37            4.9          3.6           1.4          0.1      setosa
57            4.9          2.4           3.3          1.0  versicolor
106           4.9          2.5           4.5          1.7   virginica
4             5.0          3.6           1.4          0.2      setosa
7             5.0          3.4           1.5          0.2      setosa
25            5.0          3.0           1.6          0.2      setosa
26            5.0          3.4           1.6          0.4      setosa
35            5.0          3.2           1.2          0.2      setosa
40            5.0          3.5           1.3          0.3      setosa
43            5.0          3.5           1.6          0.6      setosa
49            5.0          3.3           1.4          0.2      setosa
..            ...          ...           ...          ...         ...
58            6.6          2.9           4.6          1.3  versicolor
75            6.6          3.0           4.4          1.4  versicolor
65            6.7          3.1           4.4          1.4  versicolor
77            6.7          3.0           5.0          1.7  versicolor
86            6.7          3.1           4.7          1.5  versicolor
108           6.7          2.5           5.8          1.8   virginica
124           6.7          3.3           5.7          2.1   virginica
140           6.7          3.1           5.6          2.4   virginica
144           6.7          3.3           5.7          2.5   virginica
145           6.7          3.0           5.2          2.3   virginica
76            6.8          2.8           4.8          1.4  versicolor
112           6.8          3.0           5.5          2.1   virginica
143           6.8          3.2           5.9          2.3   virginica
52            6.9          3.1           4.9          1.5  versicolor
120           6.9          3.2           5.7          2.3   virginica
139           6.9          3.1           5.4          2.1   virginica
141           6.9          3.1           5.1          2.3   virginica
50            7.0          3.2           4.7          1.4  versicolor
102           7.1          3.0           5.9          2.1   virginica
109           7.2          3.6           6.1          2.5   virginica
125           7.2          3.2           6.0          1.8   virginica
129           7.2          3.0           5.8          1.6   virginica
107           7.3          2.9           6.3          1.8   virginica
130           7.4          2.8           6.1          1.9   virginica
105           7.6          3.0           6.6          2.1   virginica
117           7.7          3.8           6.7          2.2   virginica
118           7.7          2.6           6.9          2.3   virginica
122           7.7          2.8           6.7          2.0   virginica
135           7.7          3.0           6.1          2.3   virginica
131           7.9          3.8           6.4          2.0   virginica

[150 rows x 5 columns]

In [267]:
# descending sorting

In [269]:
iris.sort_values(['sepal_length'],ascending = False)

     sepal_length  sepal_width  petal_length  petal_width     species
131           7.9          3.8           6.4          2.0   virginica
135           7.7          3.0           6.1          2.3   virginica
122           7.7          2.8           6.7          2.0   virginica
117           7.7          3.8           6.7          2.2   virginica
118           7.7          2.6           6.9          2.3   virginica
105           7.6          3.0           6.6          2.1   virginica
130           7.4          2.8           6.1          1.9   virginica
107           7.3          2.9           6.3          1.8   virginica
125           7.2          3.2           6.0          1.8   virginica
109           7.2          3.6           6.1          2.5   virginica
129           7.2          3.0           5.8          1.6   virginica
102           7.1          3.0           5.9          2.1   virginica
50            7.0          3.2           4.7          1.4  versicolor
120           6.9          3.2           5.7          2.3   virginica
52            6.9          3.1           4.9          1.5  versicolor
139           6.9          3.1           5.4          2.1   virginica
141           6.9          3.1           5.1          2.3   virginica
143           6.8          3.2           5.9          2.3   virginica
76            6.8          2.8           4.8          1.4  versicolor
112           6.8          3.0           5.5          2.1   virginica
86            6.7          3.1           4.7          1.5  versicolor
77            6.7          3.0           5.0          1.7  versicolor
140           6.7          3.1           5.6          2.4   virginica
144           6.7          3.3           5.7          2.5   virginica
108           6.7          2.5           5.8          1.8   virginica
145           6.7          3.0           5.2          2.3   virginica
124           6.7          3.3           5.7          2.1   virginica
65            6.7          3.1           4.4          1.4  versicolor
58            6.6          2.9           4.6          1.3  versicolor
75            6.6          3.0           4.4          1.4  versicolor
..            ...          ...           ...          ...         ...
49            5.0          3.3           1.4          0.2      setosa
25            5.0          3.0           1.6          0.2      setosa
93            5.0          2.3           3.3          1.0  versicolor
35            5.0          3.2           1.2          0.2      setosa
40            5.0          3.5           1.3          0.3      setosa
7             5.0          3.4           1.5          0.2      setosa
60            5.0          2.0           3.5          1.0  versicolor
4             5.0          3.6           1.4          0.2      setosa
57            4.9          2.4           3.3          1.0  versicolor
1             4.9          3.0           1.4          0.2      setosa
9             4.9          3.1           1.5          0.1      setosa
34            4.9          3.1           1.5          0.2      setosa
37            4.9          3.6           1.4          0.1      setosa
106           4.9          2.5           4.5          1.7   virginica
11            4.8          3.4           1.6          0.2      setosa
30            4.8          3.1           1.6          0.2      setosa
24            4.8          3.4           1.9          0.2      setosa
45            4.8          3.0           1.4          0.3      setosa
12            4.8          3.0           1.4          0.1      setosa
29            4.7          3.2           1.6          0.2      setosa
2             4.7          3.2           1.3          0.2      setosa
22            4.6          3.6           1.0          0.2      setosa
6             4.6          3.4           1.4          0.3      setosa
47            4.6          3.2           1.4          0.2      setosa
3             4.6          3.1           1.5          0.2      setosa
41            4.5          2.3           1.3          0.3      setosa
42            4.4          3.2           1.3          0.2      setosa
38            4.4          3.0           1.3          0.2      setosa
8             4.4          2.9           1.4          0.2      setosa
13            4.3          3.0           1.1          0.1      setosa

[150 rows x 5 columns]

In [270]:
# not sure if you could do ascending on one column and descending on another column

In [272]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [273]:
# summarising data

In [280]:
S = iris.agg( {
'sepal_length':'mean',
'petal_length':'mean',
'petal_width':'mean'})

In [281]:
type(S)

pandas.core.series.Series

In [282]:
# the result produces a series

In [283]:
# grouping data and then summarising

In [284]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [289]:
iris.groupby('species'
   ).agg({'sepal_length':'mean'}
   )

            sepal_length
species
setosa             5.006
versicolor         5.936
virginica          6.588

In [286]:
# transforming

In [288]:
iris.assign(
sepal_length2 = iris.sepal_length**2,
petal_length2 = iris.petal_length**2).head(z)

,sepal_length,sepal_width,petal_length,petal_width,species,sepal_length2,petal_length2
0,5.1,3.5,1.4,0.2,setosa,26.01,1.96
1,4.9,3.0,1.4,0.2,setosa,24.01,1.96
2,4.7,3.2,1.3,0.2,setosa,22.09,1.69
3,4.6,3.1,1.5,0.2,setosa,21.16,2.25
4,5.0,3.6,1.4,0.2,setosa,25.00,1.96
5,5.4,3.9,1.7,0.4,setosa,29.16,2.89
6,4.6,3.4,1.4,0.3,setosa,21.16,1.96
7,5.0,3.4,1.5,0.2,setosa,25.00,2.25
8,4.4,2.9,1.4,0.2,setosa,19.36,1.96
9,4.9,3.1,1.5,0.1,setosa,24.01,2.25
10,5.4,3.7,1.5,0.2,setosa,29.16,2.25
11,4.8,3.4,1.6,0.2,setosa,23.04,2.56
12,4.8,3.0,1.4,0.1,setosa,23.04,1.96
13,4.3,3.0,1.1,0.1,setosa,18.49,1.21
14,5.8,4.0,1.2,0.2,setosa,33.64,1.44
15,5.7,4.4,1.5,0.4,setosa,32.49,2.25
16,5.4,3.9,1.3,0.4,setosa,29.16,1.69
17,5.1,3.5,1.4,0.3,setosa,26.01,1.96
18,5.7,3.8,1.7,0.3,setosa,32.49,2.89
19,5.1,3.8,1.5,0.3,setosa,26.01,2.25
20,5.4,3.4,1.7,0.2,setosa,29.16,2.89
21,5.1,3.7,1.5,0.4,setosa,26.01,2.25
22,4.6,3.6,1.0,0.2,setosa,21.16,1.00
23,5.1,3.3,1.7,0.5,setosa,26.01,2.89
24,4.8,3.4,1.9,0.2,setosa,23.04,3.61
25,5.0,3.0,1.6,0.2,setosa,25.00,2.56
26,5.0,3.4,1.6,0.4,setosa,25.00,2.56
27,5.2,3.5,1.5,0.2,setosa,27.04,2.25
28,5.2,3.4,1.4,0.2,setosa,27.04,1.96
29,4.7,3.2,1.6,0.2,setosa,22.09,2.56
...,...,...,...,...,...,...,...
120,6.9,3.2,5.7,2.3,virginica,47.61,32.49
121,5.6,2.8,4.9,2.0,virginica,31.36,24.01
122,7.7,2.8,6.7,2.0,virginica,59.29,44.89
123,6.3,2.7,4.9,1.8,virginica,39.69,24.01
124,6.7,3.3,5.7,2.1,virginica,44.89,32.49
125,7.2,3.2,6.0,1.8,virginica,51.84,36.00
126,6.2,2.8,4.8,1.8,virginica,38.44,23.04
127,6.1,3.0,4.9,1.8,virginica,37.21,24.01
128,6.4,2.8,5.6,2.1,virginica,40.96,31.36
129,7.2,3.0,5.8,1.6,virginica,51.84,33.64
130,7.4,2.8,6.1,1.9,virginica,54.76,37.21
131,7.9,3.8,6.4,2.0,virginica,62.41,40.96
132,6.4,2.8,5.6,2.2,virginica,40.96,31.36
133,6.3,2.8,5.1,1.5,virginica,39.69,26.01
134,6.1,2.6,5.6,1.4,virginica,37.21,31.36
135,7.7,3.0,6.1,2.3,virginica,59.29,37.21
136,6.3,3.4,5.6,2.4,virginica,39.69,31.36
137,6.4,3.1,5.5,1.8,virginica,40.96,30.25
138,6.0,3.0,4.8,1.8,virginica,36.00,23.04
139,6.9,3.1,5.4,2.1,virginica,47.61,29.16
140,6.7,3.1,5.6,2.4,virginica,44.89,31.36
141,6.9,3.1,5.1,2.3,virginica,47.61,26.01
142,5.8,2.7,5.1,1.9,virginica,33.64,26.01
143,6.8,3.2,5.9,2.3,virginica,46.24,34.81
144,6.7,3.3,5.7,2.5,virginica,44.89,32.49
145,6.7,3.0,5.2,2.3,virginica,44.89,27.04
146,6.3,2.5,5.0,1.9,virginica,39.69,25.00
147,6.5,3.0,5.2,2.0,virginica,42.25,27.04
148,6.2,3.4,5.4,2.3,virginica,38.44,29.16
149,5.9,3.0,5.1,1.8,virginica,34.81,26.01

In [290]:
iris[sepal_length]

NameError: name 'sepal_length' is not defined

In [291]:
# pandas equivelent of summarise_all

In [292]:
iris.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [293]:
iris.sum()

sepal_length                                                876.5
sepal_width                                                 458.6
petal_length                                                563.7
petal_width                                                 179.9
species         setosasetosasetosasetosasetosasetosasetosaseto...
dtype: object

In [294]:
iris.count()

sepal_length    150
sepal_width     150
petal_length    150
petal_width     150
species         150
dtype: int64

In [295]:
iris.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [296]:
iris.min()

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [297]:
iris.median()

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [298]:
iris.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [299]:
# now trying these with the grouping function

In [301]:
iris.groupby('species').mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [302]:
# shorthand for summarising a specific variable is to select one column and then do the all functions

In [303]:
iris['sepal_length'].mean()

5.843333333333335

In [305]:
# grouped
iris.groupby('species')['sepal_length'].mean()

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

In [306]:
# correlations

In [307]:
iris.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [308]:
# not sure how to use spearman correlation.

In [312]:
# equivelent of R mutate_all
import numpy as np

In [314]:
iris.drop('species',axis = 1).apply(np.mean)

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [319]:
iris.drop('species',axis = 1).apply(np.exp).head()

   sepal_length  sepal_width  petal_length  petal_width
0    164.021907    33.115452      4.055200     1.221403
1    134.289780    20.085537      4.055200     1.221403
2    109.947172    24.532530      3.669297     1.221403
3     99.484316    22.197951      4.481689     1.221403
4    148.413159    36.598234      4.055200     1.221403

In [320]:
# huge limitation is that you have to do data splitting and combining

In [321]:
# pivot table